app/controllers/songs_controller.rb

SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 0]]
---
  def index
    if params[:artist_id]
      begin
        artist=Artist.find(params[:artist_id])

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 7]]
---
  def show
    begin
    @song = Song.find(params[:id])